# ReverseIterator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TemperatureRatingTypeSet..::..ReverseIterator Method
TemperatureRatingTypeSet Class See Also
---
Retrieve a backward moving iterator to the set.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual TemperatureRatingTypeSetIterator ReverseIterator()
```

Visual Basic
---
```text
Public Overridable Function ReverseIterator As TemperatureRatingTypeSetIterator
```

Visual C++
---
```text
public:
virtual TemperatureRatingTypeSetIterator^ ReverseIterator()
```

# ### Return Value
Returns a backward moving iterator to the set.
# See Also
TemperatureRatingTypeSet Class
Autodesk.Revit.DB.Electrical Namespace